models/deepseek-v2-lite/benchmark_results/p50_sweep_20260315_101559/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7549664499e0>, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260315_101559', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-d69b0d76-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 10:16:24 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:52<00:00,  1.92it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  52.03     
Total input tokens:                      1386900   
Total generated tokens:                  25200     
Request throughput (req/s):              1.92      
Output token throughput (tok/s):         484.37    
Peak output token throughput (tok/s):    606.00    
Peak concurrent requests:                75.00     
Total token throughput (tok/s):          27142.10  
---------------Time to First Token----------------
Mean TTFT (ms):                          14342.47  
Median TTFT (ms):                        14541.00  
P50 TTFT (ms):                           14541.00  
P90 TTFT (ms):                           24463.43  
P95 TTFT (ms):                           25322.06  
P99 TTFT (ms):                           26154.98  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.84     
Median TPOT (ms):                        24.96     
P50 TPOT (ms):                           24.96     
P90 TPOT (ms):                           25.26     
P95 TPOT (ms):                           25.31     
P99 TPOT (ms):                           25.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.84     
Median ITL (ms):                         24.88     
P50 ITL (ms):                            24.88     
P90 ITL (ms):                            26.35     
P95 ITL (ms):                            27.02     
P99 ITL (ms):                            30.50     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20578.18  
Median E2EL (ms):                        20822.83  
P50 E2EL (ms):                           20822.83  
P90 E2EL (ms):                           30729.81  
P95 E2EL (ms):                           31567.25  
P99 E2EL (ms):                           32247.42  
==================================================